// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friend =  ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friend.length >= 3){
    document.write('це великий масив, в якому  3 і більше елементи')
    console.log('це великий масив, в якому  3 і більше елементи')
}else {
    console.log('це маленький масив, в якому менше 3-х елементів')
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.


// - Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
let a= 2;
let b= 4;

if (a + b < 4) {
    console.log(result = 'Мало');
} else {
    console.log(result = 'Багато');
}
a + b < 4? console.log(result = 'Мало'):console.log(result = 'Багато');


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test=21;
test? console.log('вірно'):console.log('невірно');
!test? console.log('вірно'):console.log('невірно');
let test2;
test2? console.log('вірно'):console.log('невірно');
!test2? console.log('вірно'):console.log('невірно');

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let asd= prompt('Яка «офіційна» назва JavaScript?');
// if (asd === 'ECMAScript'){
//     document.write('<p>Правильно</p>')
//     console.log('Правильно')
// }else {
//     document.write('Не знаєте? ECMAScript!')
//     console.log('Не знаєте? ECMAScript!')
// }

//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let kv=32;
if (kv =>1 && kv <= 20 ){
    console.log('перший ')
}else if  (kv =>21 && kv <= 48 ){
    console.log('другий')
}else if  (kv =>49 && kv <= 90 ){
    console.log('третій')
}else {
    console.log('такої квартири немає')
}
//
// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// const number = +prompt('задає числове значення')
// number === 10? console.log('ВІРНО'): console.log('НЕВІРНО')

    // - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    // Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    // Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temC = 7;
if (temC => 10 && temC <= 22) {
    console.log('йдемо ВЧИТИСЯ')
} else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д )
//     і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let zzx = 5;
switch (zzx) {
        case 1:
        console.log('Авто')
        break;
        case 2:
        console.log('Мото')
        break;
        case 3:
        console.log('квартиру')
        break;
        case 4:
        console.log('телефон')
        break;
        case 5:
        console.log('шоколадку')
        break;
}
