// --створити масив з:
//     - з 5 числових значень
let a1= [2,3,6,5,4];

// - з 5 стічкових значень
let a2= ['oksana','anna','liay','myla','start'];
// - з 5 значень стрічкового, числового та булевого типу
let a3 =['oksana',"anna", 'true', 'false', 'undefined ']
// - та вивести його в консоль
console.log(a1,a2,a3)
console.log('**************************************************************************************')
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
let a4 = [];
a4[0] = 78;
a4[1] = 785;
a4[2] = 786;
a4[3] = 783;
a4[4] = 787;
a4[5] = 784;
a4[6] = 781;
console.log(a4)
console.log('**************************************************************************************')


//
//
//
// - є масив
let a5 = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
  i = 0;
  while (i < a5.length){
      console.log(a5[i])
      i++
  }
console.log('**************************************************************************************')

//     2. перебрати його циклом for

for (let j = 0; j < a5.length; j++) {
    const a5Element = a5[j];
    console.log(a5Element)
}
console.log('**************************************************************************************')

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
q = 1;
while (q < a5.length){
    console.log(a5[q])
    q+=2
}
console.log('**************************************************************************************')

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (let j = 1; j < a5.length; j+=2) {
    console.log(a5[j])
}
console.log('**************************************************************************************')

// 5. перебрати циклом while та вивести  числа тільки парні  значення
q1 = 0;
while (q1 < a5.length){
    console.log(a5[q1])
    q1+=2
}
console.log('**************************************************************************************')
// 6. перебрати циклом for та вивести  числа тільки парні  значення

for (let j = 0; j < a5.length; j+=2) {
    const a5Element = a5[j];
    console.log(a5Element)

}
console.log('**************************************************************************************')

// 7. замінити кожне число кратне 3 на слово "okten"
for (let j = 3; j < a5.length; j+=3) {
    const a5Element = a5[j];

    console.log(a5Element)

}
console.log('**************************************************************************************')

// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let qwe = [3,2,5,8,6,9,5,7,9,4,7,5,6]
for (let j = 0; j < qwe.length; j++) {
    const qweElement = qwe[j];
    console.log(qweElement)
}
console.log('**************************************************************************************')

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let qwe1 = ['3zxc','2zxc','5zxc','8zx','6zxc','9zxc','5zxc','7zxc','9zxc','4zxc','7zxc','5zxc','6zxc']
for (let j = 0; j < qwe1.length; j++) {
    const qwe1Element = qwe1[j];
    console.log(qwe1Element)
}
console.log('**************************************************************************************')
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let qwe2 = ['3zxc','2zxc','5zxc','8zx','6zxc','9zxc','5zxc','7zxc','9zxc','4zxc','7zxc','5zxc','6zxc',2,35,464,6565]
for (let j = 0; j < qwe2.length; j++) {
    const qwe2Element = qwe2[j];
    console.log(qwe2Element)
}
console.log('**************************************************************************************')
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор