
// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)


// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
const xxxxx1 = (nnn1) => {
    let aaa1 = nnn1[0];
    for (let i = 0; i < nnn1.length; i++) {
        aaa1 < nnn1[i];
        aaa1 = nnn1[i];
    }
    return aaa1
}
let arr1 =[1,2,123,-5,-78,10];
console.log(xxxxx1(arr1))

// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//

const xxxxx = (nnn) => {
    let aaa = 0;
    for (const nnnElement of nnn) {
        aaa += nnnElement
    }
    return aaa;
}
let arr =[1,2,10];
console.log(xxxxx(arr));

//
//
//
// - Дано натуральное число n. Выведите все числа от 1 до n.
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
